using System;

namespace Strings
{
    class Program
    {
        static void Main(string[] args)
        {
            // Лях Павел
            // Разработать статический класс Message, содержащий следующие статические методы для обработки текста:
            // а) Вывести только те слова сообщения,  которые содержат не более n букв.
            // б) Удалить из сообщения все слова, которые заканчиваются на заданный символ.
            // в) Найти самое длинное слово сообщения.
            // г) Сформировать строку с помощью StringBuilder из самых длинных слов сообщения.
            // д) ***Создать метод, который производит частотный анализ текста.
            //    В качестве параметра в него передается массив слов и текст, в качестве результата метод возвращает
            //    сколько раз каждое из слов массива входит в этот текст. Здесь требуется использовать класс Dictionary.

            // а
            Message.ShowFixLengthWords("Власть не честна с гражданами и не надо сомневаться ребята", 6);
            // б
            Console.WriteLine(Message.DeleteWordsEndedOnSymbol("Комсомольск-на-Амуре: доллар не будет дорожать, волноваться не стоит.", 'е'));
            // в
            Console.WriteLine(Message.FindLongestWord("Хорошо играл Рубинштейн, в Ростове-на-Дону, на скрипке"));
            // г
            Console.WriteLine(Message.FindLongestWords("Но Рубинштейн проиграл в шахматы Вайнштейну"));
            // д
            Console.WriteLine();
            string[] words = new string[] { "велосипедист", "Шоу", "Бернарда" };
            string text = @"Однажды Бернарда Шоу сбил велосипедист; Шоу не удержался на ногах и упал. 
                            Велосипедист стал приносить извинения за устроенное шоу, Шоу отреагировал на них такими словами:
                            - Молодой человек, только что вы упустили замечательную возможность навеки войти в историю - как убийца Бернарда Шоу!";
            
            Message.QuantityWordsInText(words, text, false);            

            // *Для двух строк написать метод, определяющий, является ли одна строка перестановкой другой.
            // Например:
            // badc являются перестановкой abcd.
            Console.WriteLine();
            string firstWord  = "badc";
            string secondWord = "abcd";

            Console.WriteLine($"Перестановка (LINQ + Compare):       {Message.IsTransposition(firstWord, secondWord)}");
            Console.WriteLine($"Перестановка (Сортировка пузырьком): {Message.IsTranspositionSimple(firstWord, secondWord)}");

            Console.ReadLine();
        }
    }
}
