using System;

namespace Believe
{
    class Program
    {
        static void Main(string[] args)
        {
            // Лях Павел
            // 5. **Написать игру «Верю. Не верю». В файле хранятся вопрос и ответ, правда это или нет.
            // Например: «Шариковую ручку изобрели в древнем Египте», «Да».
            // Компьютер загружает эти данные, случайным образом выбирает 5 вопросов и задаёт их игроку.
            // Игрок отвечает Да или Нет на каждый вопрос и набирает баллы за каждый правильный ответ.
            // Список вопросов ищите во вложении или воспользуйтесь интернетом.

            Quiz.StartVictorina("data.txt");

            Console.ReadLine();
        }
    }
}
